  internal_load_balancers = {     ##############   this is for internal load balancer #################
  VES-ILB-zUC1-INT-UNIT-SS-APP-001 = {
    rg_name  = "VES-RG-zUC1-NPROD-SS-NETWORK-001"
    location = "centralus"
    frontend_ips = {

      "voyamdmcloud.zuc1.unit.gluedomain.io" = { 
        subnet_name        = "VES-SUBNET-zUC1-INT-UNIT-SS-APP-VIP"
        vnet_name          = "VES-vNET-zUC1-INT-UNIT-SS"
        rg_name            = "VES-RG-zUC1-NPROD-SS-NETWORK-001"
        private_ip_address = "10.151.224.200"
        zones              = ["1", "2", "3"]
      },# adding new loadbalancer front end IP here }
       "snaplogic.unit.gluedomain.io" = { 
        subnet_name        = "VES-SUBNET-zUC1-INT-UNIT-SS-APP-VIP"
        vnet_name          = "VES-vNET-zUC1-INT-UNIT-SS"
        rg_name            = "VES-RG-zUC1-NPROD-SS-NETWORK-001"
        private_ip_address = "10.151.224.201"
        zones              = ["1", "2", "3"]
      }, 

    }
    tags = {AppSupportGroup = "NA",ApplicationName = "NA"}
  },
  
}

When i try to run the code above to add the new frontend ip it does want to do an update in place but the message i get from terraform is it wants to change the current front end IP and re add the original 
####################################
in your example it looks like you are working on a EXTERNAL  balancer which is different from an INTERNAL  load balancer
#############################



############################################################################################################

MESSAGE from TERRAFORM 

Terraform will perform the following actions:

  # module.ilb["VES-ILB-zUC1-INT-UNIT-SS-APP-001"].azurerm_lb.tf-ilb will be updated in-place
  ~ resource "azurerm_lb" "tf-ilb" {
        id                   = "/subscriptions/8964a126-b57d-470d-9f43-73df029f50ba/resourceGroups/VES-RG-zUC1-NPROD-SS-NETWORK-001/providers/Microsoft.Network/loadBalancers/VES-ILB-zUC1-INT-UNIT-SS-APP-001"
        name                 = "VES-ILB-zUC1-INT-UNIT-SS-APP-001"
        tags                 = {
            "AppSupportGroup"   = "NA"
            "ApplicationName"   = "NA"
            "CloudRegion"       = "centralus"
            "InfraSupportGroup" = "X_NETWORK_CLOUD"
            "SDLCRegion"        = "UNIT"
            "ServiceType"       = "Network"
            "SupportGroup"      = "networkers@list.voya.com"
        }
        # (6 unchanged attributes hidden)

      ~ frontend_ip_configuration {
            id                            = "/subscriptions/8964a126-b57d-470d-9f43-73df029f50ba/resourceGroups/VES-RG-zUC1-NPROD-SS-NETWORK-001/providers/Microsoft.Network/loadBalancers/VES-ILB-zUC1-INT-UNIT-SS-APP-001/frontendIPConfigurations/voyamdmcloud.zuc1.unit.gluedomain.io"
          ~ name                          = "voyamdmcloud.zuc1.unit.gluedomain.io" -> "snaplogic.unit.gluedomain.io"
          ~ private_ip_address            = "10.151.224.200" -> "10.151.224.201"    ###right here it is changing the current *****
            # (7 unchanged attributes hidden)
        }
      + frontend_ip_configuration {
          + inbound_nat_rules             = (known after apply)
          + load_balancer_rules           = (known after apply)
          + name                          = "voyamdmcloud.zuc1.unit.gluedomain.io"
          + outbound_rules                = (known after apply)
          + private_ip_address            = "10.151.224.200"
          + private_ip_address_allocation = "static"
          + private_ip_address_version    = "IPv4"
          + subnet_id                     = "/subscriptions/8964a126-b57d-470d-9f43-73df029f50ba/resourceGroups/VES-RG-zUC1-NPROD-SS-NETWORK-001/providers/Microsoft.Network/virtualNetworks/VES-vNET-zUC1-INT-UNIT-SS/subnets/VES-SUBNET-zUC1-INT-UNIT-SS-APP-VIP"
          + zones                         = [
              + "1",
              + "2",
              + "3",
            ]
        }
    }
################################################################################################END of message from terraform 
###########################################################################

When we change the code to be alphatetically eqaul with first letter 


  internal_load_balancers = {
  VES-ILB-zUC1-INT-UNIT-SS-APP-001 = {
    rg_name  = "VES-RG-zUC1-NPROD-SS-NETWORK-001"
    location = "centralus"
    frontend_ips = {

      "voyamdmcloud.zuc1.unit.gluedomain.io" = { 
        subnet_name        = "VES-SUBNET-zUC1-INT-UNIT-SS-APP-VIP"
        vnet_name          = "VES-vNET-zUC1-INT-UNIT-SS"
        rg_name            = "VES-RG-zUC1-NPROD-SS-NETWORK-001"
        private_ip_address = "10.151.224.200"
        zones              = ["1", "2", "3"]
      }, 
       "vsnaplogic.unit.gluedomain.io" = {    #####  on this line put a v at the beginning of snap logic ###
        subnet_name        = "VES-SUBNET-zUC1-INT-UNIT-SS-APP-VIP"
        vnet_name          = "VES-vNET-zUC1-INT-UNIT-SS"
        rg_name            = "VES-RG-zUC1-NPROD-SS-NETWORK-001"
        private_ip_address = "10.151.224.201"
        zones              = ["1", "2", "3"]
      }, 

    }
    tags = {AppSupportGroup = "NA",ApplicationName = "NA"}
  },
  
}

#########################################################################################
once we put a v on to the name of the front end IP it just wanted to add it 

I also tried tried changing to a Z and it wanted to change the current then re add it as well Unfortunately i did not save the output from terraform